# Energy Analysis Zone Use Humidification Set Point Property

Source: https://www.revitapidocs.com/2026/aff3ed0e-d835-90cf-e94d-8e383dc239a0.htm

---

| Energy Analysis Zone Use Humidification Set Point Property |
| --- |

Use the humidification set point.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool UseHumidificationSetPoint { get; }
```

```
Public ReadOnly Property UseHumidificationSetPoint As Boolean
	Get
```

```
public:
property bool UseHumidificationSetPoint {
	bool get ();
}
```

```
member UseHumidificationSetPoint : bool with get
```

#### Property Value

Boolean See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace